Revit 2027 API
RebarHandlesData.AddCustomHandle Method
 Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCustomHandle(
	int customHandleTag
)
Public Sub AddCustomHandle (
	customHandleTag As Integer
)
public:
void AddCustomHandle(
	int customHandleTag
)
member AddCustomHandle :
        customHandleTag : int -> unit
Parameters
customHandleTag Int32
 The tag of the handle. The tag should be different from the previous ones that were added.
Exceptions
Exception | Condition
ArgumentException |  customHandleTag is a duplicate tag.
See Also
Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace